Repository: sallind/dmap2gcode
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: fr

source: (Psyco Loaded)
fr: (Psyco chargé)

source: Python Imaging Library (PIL) was not found
fr: Python Imaging Library (PIL) n'a pas été trouvé

source: The program will function but some functionality will be disabled.
fr: Le programme fonctionnera, mais certaines fonctionnalités sont désactivées.

source: PIL enables more image file formats and enables the
fr: PIL permet plus de formats de fichiers d'image et de permettre de

source: preview image to scale with the window size.
fr: prévisualiser l’image à l'échelle de la taille de la fenêtre.

source: NumPy was not found.
fr: NumPy n'a pas été trouvé.

source: The program will function properly but the speed will be reduced.
fr: Le programme fonctionnera correctement, mais la vitesse sera réduite.

source: With NumPy the speed of gcode generation is about eight times faster.
fr: Avec NumPy la vitesse de génération du G-code est d'environ huit fois plus rapide.

source: Welcome to dmap2gcode
fr: Bienvenue avec dmap2gcode

source: Save G-Code
fr: Enregistrer

source: Open Roughing Settings
fr: Paramètres d’ébauche

source: Image Size:
fr: Taille image:

source: Image Height
fr: Hauteur image

source: Image Width
fr: Largeur image

source: Pixel Size
fr: Taille pixel

source: Image Properties:
fr: Propriété d’image:

source: Depth Color
fr: Prof. de couleur

source: Black
fr: Noir

source: White
fr: Blanc

source: Normalize Depth
fr: Normaliser prof.

source: Cut Top Surface
fr: Couper Surface

source: Top Tolerance
fr: Tolérance sur

source: Tool Properties:
fr: Propriétés d'outils:

source: Tool DIA
fr: Diamètre d’outil

source: Tool End
fr: Type d’outil

source: V-Bit Angle
fr: Angle V-Bit

source: Gcode Properties:
fr: Propriété G-Code:

source: Scan Pattern
fr: Balayage modèle

source: Cut Perimeter
fr: Couper périmètre

source: Scan Direction
fr: Direction scan

source: Feed Rate
fr: Vitesse dépl.

source: Plunge Feed
fr: Vitesse plongée

source: Stepover
fr: Enjambée

source: Z Safe
fr: Sécurité Z

source: Max Cut Depth
fr: Profondeur Max

source: Open G-Code File
fr: Ouvrir fichier G-Code

source: Open Image File
fr: Ouvrir fichier image

source: Save G-Code File
fr: Enregistrer fichier G-Code

source: Save Roughing G-Code File
fr: Sauve le fichier d’ébauche G-Code

source: Write To Axis and Exit
fr: Ecrire à l'axe et quitter

source: Exit
fr: Quitter

source: File
fr: Fichier

source: Copy G-Code Data to Clipboard
fr: Copie des données G-Code dans le presse-papiers

source: Edit
fr: Editer

source: Refresh
fr: Rafraichir

source: Show Origin Axis
fr: Voir l’axe de l’origine

source: View
fr: Vue

source: General Settings
fr: Paramètre général

source: Roughing Settings
fr: Paramètres ébauche

source: Settings
fr: Paramètres

source: About
fr: A propos

source: Help (Web Page)
fr: Aide (Site Web)

source: Help
fr: Aide

source: Unable interpret command line options
fr: Impossible d'interpréter les options de ligne de commande

source: Usage: python dmap2gcode.py [-g file]
fr: Utilisation: python dmap2gcode.py [-g fichier]

source: -g : dmap2gcode gcode output file to read (also --gcode_file)
fr: -g : fichier de sortie gcode de dmap2gcode à lire (ou --gcode_file)

source: -h : print this help (also --help)
fr: -h : affiche cette aide (ou --help)

source: Recalculation required.
fr: Re-calcul requis

source: Value should be a number.
fr: La valeur doit être un nombre.

source: Replace
fr: Remplace

source: Replace Exiting Configuration File?
fr: Remplace un fichier de configuration existant?

source: Unable to open file for writing: %s
fr: Impossible d'ouvrir le fichier pour l'écriture: %s

source: Configuration File Saved: %s
fr: Fichier de configuration enregistrer: %s.

source: No Image Loaded
fr: Pas ouvert d'image

source: Converter Error: Setting to, Alternating
fr: Erreur de conversion: Réglage en alternance

source: G-Code Sent to Clipboard
fr: Copie des données G-Code dans le presse-papiers

source: Exiting!
fr: Quitter!

source: Height should be greater than 0
fr: La hauteur doit être supérieure à 0

source: Tolerance should be less than or equal to 0
fr: La tolérance doit être inférieure ou égale à 0

source: Diameter should be greater than 0
fr: Le diamètre doit être supérieur à 0

source: Angle should be between 0 and 180
fr: Angle doit être compris entre 0 et 180

source: Feed should be greater than 0
fr: L'alimentaiton doit être supérieure à 0

source: Stepover should be greater than 0
fr: L'enjambement doit être supérieur à 0

source: Z safe should be greater than 0
fr: La securité Z doit être supérieur à 0

source: Max depth should be less than 0
fr: La profondeur maximale doit être inférieure à 0

source: Roughing offset should be greater than or equal to 0
fr: Ebauche de décalage doit être supérieure ou égale à 0

source: Roughing depth per pass should be greater than or equal to 0
fr: L'ébauche de profondeur par passe doit être supérieure ou égale à 0

source: Tolerance should be greater than 0
fr: La tolérance doit être supérieure à 0

source: Contact angle should be between 0 and 90
fr: Angle de contact doit être comprise entre 0 et 90

source: Entry Error Detected: Check Entry Values in General Settings Window
fr: Entrée Erreur détectée: Vérifiez les valeurs d'entrée dans Paramètres généraux Fenêtre

source: Entry Error Detected: Check Entry Values in Main Window
fr: Entrée Erreur détectée: Vérifiez les valeurs d'entrée dans la fenêtre principale

source: Entry Error Detected: Check Entry Values in Roughing Settigns Window
fr: Entrée Erreur détectée: Vérifiez les valeurs d'entrée dans la fenêtre Paramètres Ebauche

source: Unable to open file: %s
fr: Impossible d'ouvrir le fichier: %s

source: Image file not found: %s
fr: Image non valable: %s

source: Image file not found: %s
fr: Image non valable: %s

source: Image file: %s
fr: Fichier image: %s

source: Unable to Open Image file: %s
fr: Impossible d’ouvrir le fichier image: %s

source: Preparing Image Data
fr: Préparation donnée d’image

source: Stop Calculation
fr: Stop calcul

source: Saving File
fr: Sauve Fichier

source: Unable to create temporary icon file.
fr: Impossible de crée un fichier icône temporaire

source: skipping g-code line:
fr: sauter la ligne g-Code

source: ; may be due to non ASCII character.
fr: ; peut être due à caractère non ASCII.

source: File Saved: %s
fr: Fichier enregistrer: %s

source: File Save Terminated
fr: Enregistrement de fichier terminé

source: Units
fr: Unité

source: tolerance
fr: tolérance

source: G Code Header
fr: En-tête G Code

source: G Code Postscript
fr: Bas de page G Code

source: Lace Bounding
fr: Dentelle Reliure

source: LB Contact Angle
fr: Angle de contact LB

source: Offset Stepover
fr: Pas d'enjambée

source: None
fr: Aucun

source: 1/2 Step
fr: 1/2 Pas

source: 1/4 Step
fr: 1/4 Pas

source: Plunge Type
fr: Type de plongée

source: Disable G-Code Arcs
fr: Désactiver les arcs G Code

source: Suppress Comments
fr: Supprime les commentaires

source: Configuration File
fr: Fichier de configuration

source: Save
fr: Enregistrer

source: Close
fr: Fermer

source: Roughing Tool Properties:
fr: Propriétés de l'outil d’Ebauche:

source: Roughing Tool End
fr: Fin d’outil d’ébauche

source: Roughing Tool DIA
fr: Diam. outil d’ébauche

source: Roughing V-Bit Angle
fr: Angle V-Bit d’ébauche

source: Roughing Gcode Properties:
fr: Propriétés G-Code d’ébauche:

source: Roughing Scan Pattern
fr: Motif Ebauche du modèle

source: Roughing Scan Direction
fr: Direction de l’ébauche

source: Roughing Feed Rate
fr: Vitesse de l’ébauche

source: Roughing Plunge Feed
fr: Vit. plongée de l’ébauche

source: Roughing Stepover
fr: Enjambée d’ébauche

source: Roughing Properties:
fr: Propriété d’ébauche

source: Roughing Offset
fr: Offset d’ébauche

source: Roughing Depth/Pass
fr: Dépahsage d’ébauche

source: Save Roughing G-Code
fr: Enregistrer Ebauche G-Code

source: %.1f %% ( %.1f Minutes Remaining | %.1f Minutes Total )
fr: %.1f %% ( %.1f Temps restant [min] | %.1f Temps total [min])
